# Анализ базы данных книг по подписке

## Введение

Цель - в целях принятия маркетингового  решения необходимо провести анализ базы данных, содержащей информацию о книгах, издательствах, авторах, а также пользовательских обзорах книг.

База данных состоит из таблиц:
- Книги;
- Рейтинги;
- Обзоры книг;
- Авторы;
- Издательства

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Введение" data-toc-modified-id="Введение-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Введение</a></span></li><li><span><a href="#Просмотр-имеющихся-данных" data-toc-modified-id="Просмотр-имеющихся-данных-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Просмотр имеющихся данных</a></span></li><li><span><a href="#Анализ-данных" data-toc-modified-id="Анализ-данных-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Анализ данных</a></span><ul class="toc-item"><li><span><a href="#Посчитайте,-сколько-книг-вышло-после-1-января-2000-года;" data-toc-modified-id="Посчитайте,-сколько-книг-вышло-после-1-января-2000-года;-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Посчитайте, сколько книг вышло после 1 января 2000 года;</a></span></li><li><span><a href="#Для-каждой-книги-посчитайте-количество-обзоров-и-среднюю-оценку;" data-toc-modified-id="Для-каждой-книги-посчитайте-количество-обзоров-и-среднюю-оценку;-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Для каждой книги посчитайте количество обзоров и среднюю оценку;</a></span></li><li><span><a href="#Определите-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-вы-исключите-из-анализа-брошюры;" data-toc-modified-id="Определите-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-вы-исключите-из-анализа-брошюры;-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;</a></span></li><li><span><a href="#Определите-автора-с-самой-высокой-средней-оценкой-книг-—-учитывайте-только-книги-с-50-и-более-оценками" data-toc-modified-id="Определите-автора-с-самой-высокой-средней-оценкой-книг-—-учитывайте-только-книги-с-50-и-более-оценками-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками</a></span></li><li><span><a href="#Посчитайте-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок." data-toc-modified-id="Посчитайте-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок.-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.</a></span></li></ul></li><li><span><a href="#Выводы" data-toc-modified-id="Выводы-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Выводы</a></span></li></ul></div>

## Просмотр имеющихся данных

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# устанавливаем параметры
db_config = {'user': '', # имя пользователя
'pwd': '', # пароль
'host': '',
'port': , # порт подключения
'db': ''} # название базы данных

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
 db_config['pwd'],
 db_config['host'],
 db_config['port'],
 db_config['db'])

# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [3]:
query = ''' SELECT *
            FROM books
        '''

In [4]:
pd.io.sql.read_sql(query, con = engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268
...,...,...,...,...,...,...
995,996,571,Wyrd Sisters (Discworld #6; Witches #2),265,2001-02-06,147
996,997,454,Xenocide (Ender's Saga #3),592,1996-07-15,297
997,998,201,Year of Wonders,358,2002-04-30,212
998,999,94,You Suck (A Love Story #2),328,2007-01-16,331
999,1000,509,Zen and the Art of Motorcycle Maintenance: An ...,540,2006-04-25,143

In [5]:
query = ''' SELECT *
            FROM authors
        '''

In [6]:
pd.io.sql.read_sql(query, con = engine)

     author_id                                author
0            1                            A.S. Byatt
1            2        Aesop/Laura Harris/Laura Gibbs
2            3                       Agatha Christie
3            4                         Alan Brennert
4            5              Alan Moore/David   Lloyd
..         ...                                   ...
631        632         William Strunk Jr./E.B. White
632        633                           Zadie Smith
633        634                 Zilpha Keatley Snyder
634        635                    Zora Neale Hurston
635        636  Åsne Seierstad/Ingrid Christopherson

[636 rows x 2 columns]

In [7]:
query = ''' SELECT *
            FROM publishers
        '''

In [8]:
pd.io.sql.read_sql(query, con = engine)

     publisher_id                          publisher
0               1                                Ace
1               2                           Ace Book
2               3                          Ace Books
3               4                      Ace Hardcover
4               5  Addison Wesley Publishing Company
..            ...                                ...
335           336         Workman Publishing Company
336           337                         Wyatt Book
337           338              Yale University Press
338           339                           Yearling
339           340                     Yearling Books

[340 rows x 2 columns]

In [9]:
query = ''' SELECT *
            FROM ratings
        '''

In [10]:
pd.io.sql.read_sql(query, con = engine)

      rating_id  book_id        username  rating
0             1        1      ryanfranco       4
1             2        1   grantpatricia       2
2             3        1    brandtandrea       5
3             4        2        lorichen       3
4             5        2     mariokeller       2
...         ...      ...             ...     ...
6451       6452     1000  carolrodriguez       4
6452       6453     1000         wendy18       4
6453       6454     1000      jarvispaul       5
6454       6455     1000           zross       2
6455       6456     1000         fharris       5

[6456 rows x 4 columns]

In [39]:
query = ''' SELECT *
            FROM reviews
        '''

In [40]:
pd.io.sql.read_sql(query, con = engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...
...,...,...,...,...
2788,2789,999,martinadam,Later hospital turn easy community. Fact same ...
2789,2790,1000,wknight,Change lose answer close pressure. Spend so now.
2790,2791,1000,carolrodriguez,Authority go who television entire hair guy po...
2791,2792,1000,wendy18,Or western offer wonder ask. More hear phone f...
2792,2793,1000,jarvispaul,Republican staff bit eat material measure plan...

## Анализ данных

### Посчитайте, сколько книг вышло после 1 января 2000 года;

In [13]:
query = ''' SELECT count(book_id)
            FROM books
            WHERE publication_date > '2000-01-01'
        '''

In [14]:
pd.io.sql.read_sql(query, con = engine)

   count
0    819

819 книг вышло после 01.01.2000

### Для каждой книги посчитайте количество обзоров и среднюю оценку;

In [65]:
query = ''' SELECT b.title,
                   count(DISTINCT rev.review_id) as reviewes,
                   ROUND(AVG(r.rating), 2) as avg_rating
            FROM books AS b
            LEFT JOIN ratings AS r ON b.book_id=r.book_id
            LEFT JOIN reviews AS rev ON b.book_id=rev.book_id
            GROUP BY b.book_id
            ORDER BY reviewes DESC
        '''

In [66]:
pd.io.sql.read_sql(query, con = engine)

                                                 title  reviewes  avg_rating
0                              Twilight (Twilight  #1)         7        3.66
1                                  Water for Elephants         6        3.98
2                                     The Glass Castle         6        4.21
3    Harry Potter and the Prisoner of Azkaban (Harr...         6        4.41
4    The Curious Incident of the Dog in the Night-Time         6        4.08
..                                                 ...       ...         ...
995    Anne Rice's The Vampire Lestat: A Graphic Novel         0        3.67
996                            The Natural Way to Draw         0        3.00
997   The Cat in the Hat and Other Dr. Seuss Favorites         0        5.00
998                          Essential Tales and Poems         0        4.00
999  Disney's Beauty and the Beast (A Little Golden...         0        4.00

[1000 rows x 3 columns]

Для каждой книги посчитали количество обзоров и среднюю оценку. Книги, которые имеют большое количество обзоров, не всегда имеют высокие рейтинги, а книги с высокими рейтингами - не всегда имеют обзоры.

### Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;

In [17]:
query = ''' SELECT p.publisher,
                   COUNT(book_id) as count_book
            FROM books AS b
            INNER JOIN publishers AS p ON b.publisher_id=p.publisher_id
            WHERE b.num_pages > 50
            GROUP BY p.publisher_id
            ORDER BY count_book DESC
            LIMIT 1;
        '''

In [18]:
pd.io.sql.read_sql(query, con = engine)

       publisher  count_book
0  Penguin Books          42

Издательство, которе выпустило наибольшее количество книг (42), это Penguin Books

### Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками

In [19]:
query = ''' SELECT a.author,
                   count(r.rating_id) as count_rating,
                   ROUND(AVG(r.rating), 2) as avg_rating
            FROM books AS b
            INNER JOIN ratings AS r ON b.book_id=r.book_id
            INNER JOIN authors AS a ON b.author_id=a.author_id
            GROUP BY a.author_id
            HAVING count(r.rating_id) > 50
            ORDER BY avg_rating DESC
            LIMIT 1;
        '''

In [20]:
pd.io.sql.read_sql(query, con = engine)

                       author  count_rating  avg_rating
0  J.K. Rowling/Mary GrandPré           312        4.29

Автор с самым высоким рейтингом книг (4,29) - это J.Rowling

### Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

In [21]:
query = ''' SELECT ROUND(AVG(n_review), 2) 
             FROM (SELECT username,
                   count(review_id) as n_review
                   FROM reviews
                   WHERE username IN (SELECT username
                                      FROM ratings
                                      GROUP BY username
                                      HAVING count(rating_id) > 50)
                   GROUP BY username) as AVG_review                       
            
        '''

In [22]:
pd.io.sql.read_sql(query, con = engine)

   round
0  24.33

Среднее количество обзоров пользователей, которые поставили больше 50 оценкок, составляет 24,33

## Выводы

1. В базе данных содержатся сведения о 1000 книгах, при этом 819 книг издано после 01.01.2000;
2. Книги, которые имеют большое количество обзоров, не всегда имеют высокие рейтинги, а книги с высокими рейтингами - не всегда имеют обзоры.
3. Издательство, выпустившее наибольшее количество книг, это Penguin Books
4. Автор с самым высоким рейтингом книг - это J.Rowling
5. Среднее количество обзоров пользователей, которые поставили больше 50 оценок, составляет 24,33